Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "7o0thz" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.feedutopia-web will be updated in-place
~ resource "aws_cloudfront_distribution" "feedutopia-web" {
        id                              = "E2TI4KXVWXT68J"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ compress                   = true -> false
            # (15 unchanged attributes hidden)

          ~ forwarded_values {
                # (3 unchanged attributes hidden)

              ~ cookies {
                  ~ forward           = "none" -> "all"
                    # (1 unchanged attribute hidden)
                }
            }

          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + min_ttl                = 0
          + path_pattern           = "_auth/*"
          + target_origin_id       = "webapp-s3"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }

          + grpc_config (known after apply)

          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.edge_auth will be created
+ resource "aws_lambda_function" "edge_auth" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/websites/feedutopia/backend/edge_auth/edge_auth.zip"
      + function_name                  = "sharedservices-edge-auth"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:825765422855:layer:Python_jwt:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_edge_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "n7bHce+CksmISGxvMU8Gtp1m7amiNZRJqfB3mX4+Avg="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 5
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```